cklxx/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与小程序 BLE Recovery 安装器保持一致。分区表
# 还固定保留 cardid@0x356000 与 recovery@0x700000，二创不得改动。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 开机持续按住上键（GPIO0）5 秒，由自定义 bootloader 跳转到工厂
# 预装的 0x700000 Recovery。这些选项为 bootloader 提供长按检测配置。
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=5

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_PATH="/feishu/"
CONFIG_LV_FS_STDIO_CACHE_SIZE=0
CONFIG_LV_USE_TJPGD=y

# Don't compile LVGL's bundled examples into the app: they pull in disabled
# widgets and waste flash. Product code never references them.
CONFIG_LV_BUILD_EXAMPLES=n

# Only label/image/qrcode/obj widgets are used. Disable every other LVGL
# widget so their code never links. Pure size win, no feature loss.
CONFIG_LV_USE_ARC=n
CONFIG_LV_USE_BAR=n
CONFIG_LV_USE_BUTTON=n
CONFIG_LV_USE_BUTTONMATRIX=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CANVAS=y
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CHECKBOX=n
CONFIG_LV_USE_DROPDOWN=n
CONFIG_LV_USE_IMAGEBUTTON=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LINE=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_ROLLER=n
CONFIG_LV_USE_SCALE=n
CONFIG_LV_USE_SLIDER=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_SWITCH=n
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TEXTAREA=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n

# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 本 demo UI 简单,24KB 足够;若自建复杂界面出现绘制卡死/看门狗,调大此值。
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# --- Build: optimize for size ---
# The whole app links smaller under -Os with assertions off. Biggest single
# bit-level win with zero feature loss.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000
# Captive-portal teardown can make the Wi-Fi system event task format several
# events back-to-back. The ESP-IDF default 2304-byte stack overflowed there.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# LVGL's tiny-JPEG probe uses a 4KB local work buffer while the startup UI
# inspects image sources. Keep the main task above that fixed decoder peak.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# --- Bluetooth LE / NimBLE ---
# Voice audio streams to the PC over a BLE GATT service (demo_voice.c) — the
# device has no network in its use environment, so BLE direct-connect replaces
# Wi-Fi UDP. Minimal single-connection peripheral; no BLUFI.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_NVS_PERSIST=n
# Large ATT MTU so each audio notification carries a full ADPCM frame.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512

# --- HTTPS ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_DHM_C=y
CONFIG_MBEDTLS_HARDWARE_MPI=n
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
# Feishu user tokens make the Authorization header about 8 KB. Keep outgoing
# TLS records below the ESP32-C3 TCP send buffer (5760 bytes), so esp_http_client
# can transmit the header as multiple records instead of stalling on EAGAIN.
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# NimBLE logs "GATT procedure initiated: notify" at INFO on every notification.
# The audio path sends one every 15 ms, and esp_log writes to the USB-serial
# console synchronously, so those two lines per frame stalled the capture worker
# and dropped the delivered audio rate from ~100% of realtime to ~82%. Warnings
# and errors still print. This also drops the format strings from Flash.
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# 1000 ms. This is UP's hold-to-erase threshold — the wait before deleting starts,
# so it is felt directly every time; 2500 ms was long enough to feel broken. An early
# trigger costs nothing here, because erasing stops the moment the finger lifts.
#
# OK's long press leaves the microphone screen for onboarding, which interrupts a
# recording and must NOT be reachable in a second. It does not use this threshold:
# main.c times the hold itself and requires 2500 ms. One knob cannot serve both, and
# the gesture that destroys state is the one that needs its own number.
CONFIG_BUTTON_LONG_PRESS_TIME_MS=1000

# The audio stream sends a 482-byte notify every 30 ms. At the default 12 blocks of
# 256 bytes that is only 6 frames in flight, and the pool ran dry for 54% of sends
# (device counters read sent=29 dry=34 in one session) — every failure is a frame
# the PC never receives, which a streaming ASR reads as a gap. 48 blocks holds
# ~24 frames, covering a 360 ms controller stall. Cost is 48*256 = 12 KB of RAM,
# affordable next to the ~400 KB on this part.
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=48

# Deliberately NOT raising the BLE buffer pools. Doing so was tried and reverted:
# CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT at 60 took ENOMEM refusals from 841 to
# 0, but the delivered rate fell from 86-90% to 51-61% because the bottleneck moved
# instead of clearing — msys dry allocations went 52 -> 594 and I2S overflow 22 -> 167.
# Bigger send queues let the worker commit more frames before it blocks, which means
# longer spent not reading I2S, and the capture ring pays for it. The refusals are the
# link telling the worker to slow down; absorbing them just moves the loss upstream.
